Repository: hollowstrawberry/Trusty-cogs
Catalog: encoding/locales/*.po
Languages: fr_fr

source: Various hashing commands
fr_fr: Diverses commandes de hachage

source: MD5 Hash some Text
fr_fr: Hash MD5 un peu de texte

source: SHA1 Hash some Text
fr_fr: SHA1 Hash un peu de texte

source: SHA256 Hash some Text
fr_fr: SHA256 Hash un peu de texte

source: SHA512 Hash some Text
fr_fr: SHA512 Hash un peu de texte

source: Encode a string.
fr_fr: Encoder une chaîne.

source: Decode a string.
fr_fr: Décoder une chaîne.

source: Encode text into binary sequences of 8
fr_fr: Encoder du texte en séquences binaires de 8

source: Decode binary sequences of 8
fr_fr: Décoder des séquences binaires de 8

source: Encode text into hexadecimal
fr_fr: Encoder du texte en hexadécimale

source: Decode a hexadecimal sequence to text
fr_fr: Décoder une séquence hexadécimale au texte

source: Encode text into base 16
fr_fr: Encoder du texte en base 16

source: Decode base16 text
fr_fr: Décoder le texte de base16

source: Encode text into base 32
fr_fr: Encoder du texte en base 32

source: Decode base32 text
fr_fr: Décoder le texte base32

source: Encode text into base 64
fr_fr: Encoder du texte en base 64

source: Decode base 64 text
fr_fr: Décoder le texte de base 64

source: Encode message into character numbers
fr_fr: Encoder le message en numéros de caractères

source: Decode character numbers to a message
fr_fr: Décoder les numéros de caractères vers un message

source: Encode text into braille unicode characters
fr_fr: Encoder du texte en caractères unicode braille

source: Decide braille unicode characters to ascii
fr_fr: Décide les caractères braille unicode à ascii

source: Encode a caeser cipher message with specified key
fr_fr: Encoder un message de chiffrement de caeser avec la clé spécifiée

source: Encodes a string into DNA 4 byte ACGT format
fr_fr: Encode une chaîne au format ACGT de 4 octets

source: Decodes a string of DNA in 4 byte ACGT format.
fr_fr: Décode une chaîne d'ADN au format ACGT de 4 octets.
